Resources/Template_Cases/splashThings/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
-------------------------------------------------------------------------------
  ***    *     *  ******   *******  ******    *****     ***    *     *  ******   
 *   *   **   **  *     *  *        *     *  *     *   *   *   **    *  *     *  
*     *  * * * *  *     *  *        *     *  *        *     *  * *   *  *     *  
*******  *  *  *  ******   ****     ******    *****   *******  *  *  *  *     *  
*     *  *     *  *        *        *   *          *  *     *  *   * *  *     *  
*     *  *     *  *        *        *    *   *     *  *     *  *    **  *     *  
*     *  *     *  *        *******  *     *   *****   *     *  *     *  ******   
-------------------------------------------------------------------------------

This file is part of OpenFOAM casefiles automatically generated by AmpersandCFD*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 0;

boundaryField 
{
    #includeEtc "caseDicts/setConstraintTypes"

        inlet
    {
        type calculated;
        value uniform 1e-06;
    }
    
        outlet
    {
        type calculated;
        value uniform 0;
    }
    
        front
    {
        type symmetry;
    }
    
        back
    {
        type symmetry;
    }
    
        bottom
    {
        type symmetry;
    }
    
        top
    {
        type symmetry;
    }
    
    "geom.*"
    {
        type nutkWallFunction;
        value  $internalField;
    }
    
}